app/Models/ModelPameran.php

    public function tampildata()
    {
        $data = $this->table('tbldatapameran')->join('tbldatastok','tbldatastok.kodestok=tbldatapameran.kodestok')->get()->getResultArray();
---
SELECT *
FROM `tbldatapameran`
JOIN `tbldatastok` ON `tbldatastok`.`kodestok`=`tbldatapameran`.`kodestok`

    public function tampilPameran()
    {
        $data = $this->table('tbldatapameran')
        ->join('tbldatastok','tbldatastok.kodestok=tbldatapameran.kodestok')
        ->where('isconfirmed',NULL)
        ->get()->getResultArray();
---
SELECT *
FROM `tbldatapameran`
JOIN `tbldatastok` ON `tbldatastok`.`kodestok`=`tbldatapameran`.`kodestok`
WHERE `isconfirmed` IS NULL