app/Models/ModelTransfer.php

    public function tampildata()
    {
        $data = $this->table('tbldatatransfer')->join('tbldatastok','tbldatastok.kodestok=tbldatatransfer.kodestok')
        ->join('tbldatakendaraan','tbldatastok.kodestok=tbldatakendaraan.kodestok')->get()->getResultArray();
---
SELECT *
FROM `tbldatatransfer`
JOIN `tbldatastok` ON `tbldatastok`.`kodestok`=`tbldatatransfer`.`kodestok`
JOIN `tbldatakendaraan` ON `tbldatastok`.`kodestok`=`tbldatakendaraan`.`kodestok`

    public function tampildata_out()
    {
        $data = $this->table('tbldatatransfer')
        ->join('tbldatastok','tbldatastok.kodestok=tbldatatransfer.kodestok')
        ->join('tbldatakendaraan','tbldatastok.kodestok=tbldatakendaraan.kodestok')
        ->where('statustransfer','DRAFT')
        ->get()->getResultArray();
---
SELECT *
FROM `tbldatatransfer`
JOIN `tbldatastok` ON `tbldatastok`.`kodestok`=`tbldatatransfer`.`kodestok`
JOIN `tbldatakendaraan` ON `tbldatastok`.`kodestok`=`tbldatakendaraan`.`kodestok`
WHERE `statustransfer` = 'DRAFT'