app/Models/ModelStokOut.php

    public function tampildata()
    {
        $data = $this->table('tbldatapenjualan')->join('tbldatastok','tbldatastok.kodestok=tbldatapenjualan.kodestok')
        ->join('tbldatakendaraan','tbldatastok.kodestok=tbldatakendaraan.kodestok')->get()->getResultArray();
---
SELECT *
FROM `tbldatapenjualan`
JOIN `tbldatastok` ON `tbldatastok`.`kodestok`=`tbldatapenjualan`.`kodestok`
JOIN `tbldatakendaraan` ON `tbldatastok`.`kodestok`=`tbldatakendaraan`.`kodestok`