app/Models/ModelKendaraan.php

    public function tampilRekap()
    {
        $data = $this->table('tbldatakendaraan')
        ->join('tbltipekendaraan','tbltipekendaraan.kodetipe=tbldatakendaraan.kodetipe')
        ->join('tbldatastok','tbldatastok.kodestok=tbldatakendaraan.kodestok')
        ->where('ispublish','1')
        ->get()->getResultArray();
---
SELECT *
FROM `tbldatakendaraan`
JOIN `tbltipekendaraan` ON `tbltipekendaraan`.`kodetipe`=`tbldatakendaraan`.`kodetipe`
JOIN `tbldatastok` ON `tbldatastok`.`kodestok`=`tbldatakendaraan`.`kodestok`
WHERE `ispublish` = '1'